In [3]:
import pandas as pd

In [4]:
df3 = pd.read_csv("Chocolate Sales2.csv")
df3

,Sales Person,Country,Product,Date,Amount,Boxes Shipped
0,Jehu Rudeforth,UK,Mint Chip Choco,04-Jan-22,"$5,320",NaN
1,Van Tuxwell,India,85% Dark Bars,01-Aug-22,"$7,896",94.0
2,Gigi Bohling,India,Peanut Butter Cubes,07-Jul-22,"$4,501",91.0
3,Jan Morforth,Australia,Peanut Butter Cubes,27-Apr-22,"$12,726",342.0
4,Jehu Rudeforth,UK,Peanut Butter Cubes,24-Feb-22,"$13,685",184.0
...,...,...,...,...,...,...
1089,Karlen McCaffrey,Australia,Spicy Special Slims,17-May-22,"$4,410",323.0
1090,Jehu Rudeforth,USA,White Choc,07-Jun-22,"$6,559",119.0
1091,Ches Bonnell,Canada,Organic Choco Syrup,26-Jul-22,$574,217.0
1092,Dotty Strutley,India,Eclairs,28-Jul-22,"$2,086",384.0
1093,Karlen McCaffrey,India,70% Dark Bites,23-May-22,"$5,075",344.0

In [5]:
df3.isnull().sum()

Sales Person     0
Country          6
Product          6
Date             6
Amount           6
Boxes Shipped    6
dtype: int64

In [6]:
df3.head(5)

,Sales Person,Country,Product,Date,Amount,Boxes Shipped
0,Jehu Rudeforth,UK,Mint Chip Choco,04-Jan-22,"$5,320",NaN
1,Van Tuxwell,India,85% Dark Bars,01-Aug-22,"$7,896",94.0
2,Gigi Bohling,India,Peanut Butter Cubes,07-Jul-22,"$4,501",91.0
3,Jan Morforth,Australia,Peanut Butter Cubes,27-Apr-22,"$12,726",342.0
4,Jehu Rudeforth,UK,Peanut Butter Cubes,24-Feb-22,"$13,685",184.0

In [7]:
df3["Boxes Shipped"].mean()

np.float64(162.10110294117646)

In [8]:
# df3["Boxes Shipped"].fillna( df3["Boxes Shipped"].mean(), inplace=True )
df3["Boxes Shipped"] = df3["Boxes Shipped"].fillna( df3["Boxes Shipped"].mean() )

In [9]:
df3.isnull().sum()

Sales Person     0
Country          6
Product          6
Date             6
Amount           6
Boxes Shipped    0
dtype: int64

In [10]:
df3["Amount"]

0        $5,320
1        $7,896
2        $4,501
3       $12,726
4       $13,685
          ...
1089     $4,410
1090     $6,559
1091       $574
1092     $2,086
1093     $5,075
Name: Amount, Length: 1094, dtype: object

In [11]:
# $5,320 -> 5320
# Ã–nce formatÄ± dÃ¼zenle
# obj -> float

df3["Amount"] = df3["Amount"].astype(str).str.replace("[$,]" , "", regex=True).replace("","0")
df3["Amount"]

0        5320
1        7896
2        4501
3       12726
4       13685
         ...
1089     4410
1090     6559
1091      574
1092     2086
1093     5075
Name: Amount, Length: 1094, dtype: object

In [12]:
df3["Amount"] = ( pd.to_numeric(df3["Amount"], errors="coerce") )

In [13]:
df3["Amount"]

0        5320.0
1        7896.0
2        4501.0
3       12726.0
4       13685.0
         ...
1089     4410.0
1090     6559.0
1091      574.0
1092     2086.0
1093     5075.0
Name: Amount, Length: 1094, dtype: float64

In [14]:
df3.isnull().sum()

Sales Person     0
Country          6
Product          6
Date             6
Amount           7
Boxes Shipped    0
dtype: int64

In [15]:
# df3['Amount'] = df3 ["Amount"].fillna

In [16]:
df3["Country"].mode()[0]

'Australia'

In [17]:
df3["Country"].fillna( df3['Amount'].mode()[0], inpalce = True)

TypeError: fillna() got an unexpected keyword argument 'inpalce'

In [18]:
# Produce doldururken :Her bir "Sales Person" iÃ§in boÅŸ Ã¼rÃ¼nÃ¼, o kiÅŸinin en Ã§ok sattÄ±ÄŸÄ± Ã¼rÃ¼n ile doldurunuz.
df3["Product"].mode()

0    Eclairs
Name: Product, dtype: object

In [19]:
data = {
    "Product": ["A", "B", "A", "B", "A", "C", "C"],
    "Amount": [100, 200, 150, 250, None, 300, None]
}
df4 = pd.DataFrame(data)
df4

  Product  Amount
0       A   100.0
1       B   200.0
2       A   150.0
3       B   250.0
4       A     NaN
5       C   300.0
6       C     NaN

In [20]:
df4["Amount"].mean()

np.float64(200.0)

In [21]:
#DataFrame -> GroupBy
df4.groupby("Product")["Amount"].mean()

Product
A    125.0
B    225.0
C    300.0
Name: Amount, dtype: float64